Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions class is an extension class for all toleration related interoperation conversion methods.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.InteractorType)
Converts an Tekla.BIM.DirectManipulation.Services.Toleration.InteractorType value to a System.Int32 value.
interactorType: The Tekla.BIM.DirectManipulation.Services.Toleration.InteractorType value to convert.
Returns: The converted System.Int32 value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.Convert(System.Int32)
Converts a System.Int32 value to an Tekla.BIM.DirectManipulation.Services.Toleration.InteractorType value.
interactorType: The System.Int32 value to convert.
Returns: The converted Tekla.BIM.DirectManipulation.Services.Toleration.InteractorType value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationListenerConfiguration)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationListenerConfiguration to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.
listenerConfiguration: The toleration definition to convert.
Returns: The converted toleration definition.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.TryConvert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t,Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@)
Converts an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t to an instance of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs.
eventData: The event data to convert.
eventArgs: The converted event data.
Returns: True if the conversion succeeded; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.TryConvert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t,Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs@)
Converts an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t to an instance of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs.
eventData: The event data to convert.
eventArgs: The converted event data.
Returns: True if the conversion succeeded; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.CameraData)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.CameraData to a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t value.
e: The Tekla.BIM.DirectManipulation.Services.Toleration.CameraData instance to convert.
Returns: The converted Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationInterOpExtensions.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t)
Gets the Tekla.BIM.DirectManipulation.Services.Toleration.CameraData specified by the given Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t.
e: The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t value to get the camera data from.
Returns: The camera data.